Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གཟུགས་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན།
en: In this regard, Subhūti, bodhisattva great beings should reflect that physical forms are neither conjoined nor disjoined.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན།
en: Feelings, perceptions, formative predispositions, and consciousness are neither conjoined nor disjoined.

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are neither conjoined nor disjoined.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are neither conjoined nor disjoined.

source: གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are neither conjoined nor disjoined. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རབ་ཏུ་བརྟག་པར་བྱ་སྟེ།
en: The goals], up to and including all-aspect omniscience, are neither conjoined nor disjoined.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should persevere accordingly in the six perfections. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། གཟུགས་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ།
en: Moreover, Subhūti, bodhisattva great beings should not persevere with the notion, ‘I will be established in physical forms.’

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པར་བྱའོ། །ཞེས་བརྩོན་པར་མི་བྱའོ།
en: They should not persevere with the notion, ‘I will be established in feelings, perceptions, formative predispositions, and consciousness.’

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: They should not persevere with the notion, ‘I will be established in the sense fields, the sensory elements, and the links of dependent origination.’

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: They should not persevere with the notion, ‘I will be established in all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.’

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ།
en: They should not persevere with the notion, ‘I will be established in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.’

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་གནས་པར་བྱའོ། །ཞེས་བརྩོན་པར་མི་བྱའོ།
en: They should not persevere with the notion, ‘I will be established in the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.’

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་གནས་པར་བྱའོ་ཞེས་བརྩོན་པར་མི་བྱའོ།
en: They should not persevere with the notion, ‘I will be established in [the goals], up to and including all-aspect omniscience.’ “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུགས་ནི་གང་ལ་ཡང་མི་གནས་སོ།
en: If you ask why, physical forms are not established anywhere.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་གང་ལ་ཡང་མི་གནས་སོ།
en: Feelings, perceptions, formative predispositions, and consciousness are not established anywhere.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་གང་ལ་ཡང་མི་གནས་སོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are not established anywhere.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་གང་ལ་ཡང་མི་གནས་སོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are not established anywhere.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་གང་ལ་ཡང་མི་གནས་སོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are not established anywhere.

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་གང་ལ་ཡང་མི་གནས་སོ།
en: The ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are not established anywhere. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་གང་ལ་ཡང་མི་གནས་པ་སྟེ།
en: The goals], up to and including all-aspect omniscience, are not established anywhere.

source: དེ་ལྟར་མི་གནས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: It is in this nondwelling manner that bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment. {Ki.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་ཤིང་ཏོག་ཨ་མྲ་འམ། པ་ན་ས་ཟ་བར་འདོད་ན། དེས་ཤིང་ཏོག་ཨ་མྲ་འམ།
en: V: 64} “Subhūti, it is just as if a man wants to eat mangoes or breadfruit, he should plant mangoes or breadfruit.

source: པ་ན་ས་བསྐྱེད་པར་བྱའོ། །བསྐྱེད་ནས་ཀྱང་དུས་དུས་སུ་ཆུས་བཅུའོ། །གནོད་པ་གསལ་ལོ།
en: Having planted them, he should nurture them with water at the appropriate times, and care for them.

source: །དེ་རྒྱུ་རྐྱེན་ཚོགས་པའི་དབང་གིས་མཐར་གྱིས་འཕེལ་ན། ཤིང་ཏོག་ཨ་མྲ་འམ། པ་ན་ས་ཡོད་པར་འགྱུར་ཏེ། དེ་ཤིང་ཏོག་ཨ་མྲ་འམ། ཤིང་ཏོག་པ་ན་ས་ཟ་བར་འགྱུར་རོ།
en: Through these accumulated causes and conditions, the plants will increasingly develop, whereupon they will bear mangoes or breadfruit, and he can eat mangoes or breadfruit.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བསླབས་ཏེ།
en: In the same way, Subhūti, bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should indeed train in the six perfections.

source: སེམས་ཅན་རྣམས་སྦྱིན་པས་རྗེས་སུ་གཟུང་བར་བྱའོ། །ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱིས་རྗེས་སུ་གཟུང་བར་བྱའོ།
en: They should favor beings with gifts, and they should favor them with ethical discipline, tolerance, perseverance, meditative concentration, and wisdom.

source: །སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ།
en: They should liberate beings from cyclic existence.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བར་འདོད་པ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་འདུག་པར་འདོད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འདོད་པས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བསླབ་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings who wish not to be dependent on others, who wish to refine the buddhafields, who wish to be seated at the site of enlightenment, and who wish to turn the wheel of the Dharma should train in the six perfections.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་གསུང་ངམ།
en: Blessed Lord, do you say that they should train in the perfection of wisdom by means of the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་སྨྲའོ།
en: Subhūti,” replied the Blessed One, “I do say that they should train in the perfection of wisdom by means of the perfection of wisdom.

source: །ཆོས་ཐམས་ཅད་ལ་དབང་དུ་འགྱུར་བ་ཐོབ་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་སྨྲའོ།
en: I say that those who wish to attain sovereignty over all phenomena should train in the perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་གིས་ཆོས་ཐམས་ཅད་ལ་དབང་དུ་འགྱུར་བའི་ས་ཐོབ་པར་འགྱུར་བ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: If you ask why, it is the perfection of wisdom through which the level of sovereignty over all phenomena will be attained.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: This perfection of wisdom is the gateway to all phenomena.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོ་ནི་ཆུ་ཀླུང་ཐམས་ཅད་ཀྱི་སྒོའོ། །དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ།
en: Just as a great ocean is the gateway of all rivers, in the same way, the perfection of wisdom is indeed the gateway of all phenomena.

source: གང་ཟག་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་འམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབ་པར་བྱའོ།
en: Individuals who follow the vehicle of the śrāvakas, who follow the vehicle of the pratyekabuddhas, or who follow the vehicle of the bodhisattvas should train in this very perfection of wisdom.

source: །རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Therefore, Subhūti, bodhisattva great beings should train in the perfection of generosity, and they should train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །ནང་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བྱའོ། །ཕྱི་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བྱའོ། །ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བྱའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ།
en: They should train in the emptiness of internal phenomena, they should train in the emptiness of external phenomena, they should train in the emptiness of external and internal phenomena, and they should train in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་དུ་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་བསླབ་པར་བྱའོ།
en: They should train in the four applications of mindfulness, and similarly they should train in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path. {

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བསླབ་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: V: 65} They should train in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities and the dhāraṇī gateways.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བསླབ་པར་བྱའོ།
en: They should train in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ།
en: They should train in [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། འཕོང་གི་སློབ་དཔོན་ལག་ཚོད་དང་འབྱོར་པའི་གཞུ་ཐོགས་པ་ནི་དགྲ་དང་ཕྱིར་རྒོལ་བ་རྣམས་ཀྱིས་ཐུབ་པར་དཀའོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཐུབ་པར་དཀའོ།
en: Subhūti, just as it is hard for a master of archery holding a suitable bow to be overcome by enemies and assailants, in the same way, Subhūti, it is hard for bodhisattva great beings who practice the perfection of wisdom to be overcome by Māra or the gods in the realm of Māra.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Therefore, Subhūti, bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should train in the perfection of wisdom.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དགོངས་པ་མཛད་དོ།
en: The lord buddhas of the past, future, and present turn their enlightened intention toward those who practice the perfection of wisdom in that manner.” “

source: །གསོལ་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད།
en: How do the lord buddhas turn their enlightened intention toward bodhisattva great beings who practice the perfection of generosity?

source: ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད།
en: How do they turn their enlightened intention toward those who practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?

source: ཇི་ལྟར་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད། ཇི་ལྟར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད། ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: How do they turn their enlightened intention toward those who practice the emptiness of internal phenomena, and how do they turn their enlightened intention toward those who practice [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད། ཇི་ལྟར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: How do they turn their enlightened intention toward those who practice the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path?

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད།
en: How do they turn their enlightened intention toward those who practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways?

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད།
en: How do they turn their enlightened intention toward those who practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas?

source: ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད།
en: How do they turn their enlightened intention toward [the goals], up to and including all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་སྦྱིན་པ་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “the lord buddhas turn their enlightened intention toward bodhisattva great beings who practice the perfection of generosity, and by whatever means they turn their enlightened intention in such a way that gifts are not apprehended.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ།
en: They turn their enlightened intention toward those who practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and by whatever means they turn their enlightened intention in such a way that wisdom [and so forth] are not apprehended.

source: ཅི་ནས་ཀྱང་ཤེས་རབ་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ། །ནང་སྟོང་པ་ཉིད་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། །ཅི་ནས་ཀྱང་ནང་སྟོང་པ་ཉིད་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ།
en: They turn their enlightened intention toward those who practice the emptiness of internal phenomena, and by whatever means they turn their enlightened intention in such a way that the emptiness of internal phenomena is not apprehended.

source: ཅི་ནས་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ།
en: They turn their enlightened intention toward those who practice [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and by whatever means they turn their enlightened intention in such a way that the emptiness of the essential nature of nonentities [and so forth] are not apprehended.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: They turn their enlightened intention toward those who practice the applications of mindfulness, and by whatever means they turn their enlightened intention in such a way that the applications of mindfulness are not apprehended.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ། །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་།
en: They turn their enlightened intention toward those who practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and by whatever means they turn their enlightened intention in such a way that the noble eightfold path is not apprehended. {

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Ki.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་གཟུངས་ཀྱི་སྒོ་རྣམས་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ།
en: V: 66} They turn their enlightened intention toward those who practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, and by whatever means they turn their enlightened intention in such a way that the dhāraṇī gateways are not apprehended.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དོ།
en: They turn their enlightened intention toward those who practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas, and by whatever means they turn their enlightened intention in such a way that the eighteen distinct qualities of the buddhas are not apprehended.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྤྱོད་པ་ལ་དགོངས་པ་མཛད་དེ། ཅི་ནས་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་དམིགས་པ་དེ་ལྟར་དགོངས་པ་མཛད་དེ།
en: They turn their enlightened intention toward those who practice [the goals], up to and including all-aspect omniscience, and by whatever means they turn their enlightened intention in such a way that all-aspect omniscience [and so forth] are not apprehended.

source: དེ་ལྟར་མི་དམིགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་དགོངས་པ་མཛད་དོ།
en: They turn their enlightened intention toward bodhisattva great beings who do not apprehend in that manner. “

source: །རབ་འབྱོར་གཞན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་གཟུགས་སུ་དགོངས་པ་མི་མཛད་དོ།
en: Moreover, Subhūti, the lord buddhas do not turn their enlightened intention toward bodhisattva great beings on the basis of physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་དགོངས་པ་མི་མཛད་དོ།
en: They do not turn their enlightened intention toward them on the basis of feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་དགོངས་པ་མི་མཛད་དོ།
en: They do not turn their enlightened intention toward them on the basis of the sense fields, sensory elements, or links of dependent origination.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་དགོངས་པ་མི་མཛད་དོ།
en: They do not turn their enlightened intention toward them on the basis of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་དགོངས་པ་མི་མཛད་དོ།
en: They do not turn their enlightened intention toward them on the basis of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.
